experiments/wrk2/wrk2-19/out.txt
Running 2m test @ http://192.168.1.2
  10 threads and 600 connections
  Thread calibration: mean lat.: 1319.447ms, rate sampling interval: 5169ms
  Thread calibration: mean lat.: 1320.783ms, rate sampling interval: 5083ms
  Thread calibration: mean lat.: 1325.788ms, rate sampling interval: 5124ms
  Thread calibration: mean lat.: 1357.334ms, rate sampling interval: 4960ms
  Thread calibration: mean lat.: 1305.649ms, rate sampling interval: 5070ms
  Thread calibration: mean lat.: 1313.278ms, rate sampling interval: 5091ms
  Thread calibration: mean lat.: 1340.441ms, rate sampling interval: 4845ms
  Thread calibration: mean lat.: 1306.067ms, rate sampling interval: 5156ms
  Thread calibration: mean lat.: 1287.166ms, rate sampling interval: 4984ms
  Thread calibration: mean lat.: 1382.560ms, rate sampling interval: 5005ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.10s     9.49s   38.73s    57.95%
    Req/Sec    17.95k   139.78    18.31k    69.95%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.05s 
 75.000%   27.28s 
 90.000%   32.28s 
 99.000%   35.72s 
 99.900%   36.93s 
 99.990%   38.01s 
 99.999%   38.57s 
100.000%   38.76s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1699.839     0.000000            1         1.00
    6029.311     0.100000      1969152         1.11
    9281.535     0.200000      3941883         1.25
   12500.991     0.300000      5910502         1.43
   15777.791     0.400000      7880153         1.67
   19054.591     0.500000      9848675         2.00
   20676.607     0.550000     10833583         2.22
   22315.007     0.600000     11818738         2.50
   23953.407     0.650000     12801339         2.86
   25624.575     0.700000     13790174         3.33
   27279.359     0.750000     14774111         4.00
   28098.559     0.775000     15264288         4.44
   28934.143     0.800000     15759358         5.00
   29753.343     0.825000     16251642         5.71
   30572.543     0.850000     16736901         6.67
   31408.127     0.875000     17229042         8.00
   31850.495     0.887500     17481761         8.89
   32276.479     0.900000     17728358        10.00
   32686.079     0.912500     17973231        11.43
   33095.679     0.925000     18216531        13.33
   33521.663     0.937500     18465711        16.00
   33718.271     0.943750     18581697        17.78
   33947.647     0.950000     18711727        20.00
   34177.023     0.956250     18836121        22.86
   34406.399     0.962500     18954526        26.67
   34668.543     0.968750     19086011        32.00
   34799.615     0.971875     19150022        35.56
   34930.687     0.975000     19209267        40.00
   35061.759     0.978125     19265143        45.71
   35192.831     0.981250     19321832        53.33
   35356.671     0.984375     19384596        64.00
   35454.975     0.985938     19417875        71.11
   35553.279     0.987500     19450127        80.00
   35651.583     0.989062     19481772        91.43
   35749.887     0.990625     19507357       106.67
   35880.959     0.992188     19537454       128.00
   35946.495     0.992969     19552779       142.22
   36012.031     0.993750     19566256       160.00
   36110.335     0.994531     19583040       182.86
   36208.639     0.995313     19600459       213.33
   36306.943     0.996094     19614679       256.00
   36372.479     0.996484     19623605       284.44
   36438.015     0.996875     19631293       320.00
   36503.551     0.997266     19638386       365.71
   36569.087     0.997656     19644378       426.67
   36667.391     0.998047     19653499       512.00
   36700.159     0.998242     19656223       568.89
   36732.927     0.998437     19658474       640.00
   36798.463     0.998633     19663394       731.43
   36863.999     0.998828     19667245       853.33
   36929.535     0.999023     19671030      1024.00
   36962.303     0.999121     19672805      1137.78
   36995.071     0.999219     19674217      1280.00
   37060.607     0.999316     19676244      1462.86
   37126.143     0.999414     19678213      1706.67
   37191.679     0.999512     19679881      2048.00
   37224.447     0.999561     19680565      2275.56
   37289.983     0.999609     19681744      2560.00
   37355.519     0.999658     19682788      2925.71
   37421.055     0.999707     19683496      3413.33
   37519.359     0.999756     19684485      4096.00
   37552.127     0.999780     19684764      4551.11
   37650.431     0.999805     19685375      5120.00
   37715.967     0.999829     19685819      5851.43
   37814.271     0.999854     19686220      6826.67
   37912.575     0.999878     19686731      8192.00
   37978.111     0.999890     19687008      9102.22
   38043.647     0.999902     19687360     10240.00
   38076.415     0.999915     19687622     11702.86
   38109.183     0.999927     19687763     13653.33
   38141.951     0.999939     19687991     16384.00
   38174.719     0.999945     19688099     18204.44
   38207.487     0.999951     19688246     20480.00
   38207.487     0.999957     19688246     23405.71
   38273.023     0.999963     19688411     27306.67
   38338.559     0.999969     19688606     32768.00
   38338.559     0.999973     19688606     36408.89
   38338.559     0.999976     19688606     40960.00
   38404.095     0.999979     19688675     46811.43
   38436.863     0.999982     19688742     54613.33
   38469.631     0.999985     19688822     65536.00
   38469.631     0.999986     19688822     72817.78
   38502.399     0.999988     19688852     81920.00
   38535.167     0.999989     19688879     93622.86
   38600.703     0.999991     19688979    109226.67
   38600.703     0.999992     19688979    131072.00
   38600.703     0.999993     19688979    145635.56
   38600.703     0.999994     19688979    163840.00
   38633.471     0.999995     19689019    187245.71
   38633.471     0.999995     19689019    218453.33
   38633.471     0.999996     19689019    262144.00
   38633.471     0.999997     19689019    291271.11
   38666.239     0.999997     19689045    327680.00
   38666.239     0.999997     19689045    374491.43
   38666.239     0.999998     19689045    436906.67
   38699.007     0.999998     19689063    524288.00
   38699.007     0.999998     19689063    582542.22
   38699.007     0.999998     19689063    655360.00
   38699.007     0.999999     19689063    748982.86
   38699.007     0.999999     19689063    873813.33
   38731.775     0.999999     19689077   1048576.00
   38731.775     0.999999     19689077   1165084.44
   38731.775     0.999999     19689077   1310720.00
   38731.775     0.999999     19689077   1497965.71
   38731.775     0.999999     19689077   1747626.67
   38731.775     1.000000     19689077   2097152.00
   38731.775     1.000000     19689077   2330168.89
   38764.543     1.000000     19689085   2621440.00
   38764.543     1.000000     19689085          inf
#[Mean    =    19098.713, StdDeviation   =     9488.501]
#[Max     =    38731.776, Total count    =     19689085]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    3.12ms
 75.000%    3.82ms
 90.000%    4.63ms
 99.000%    9.44ms
 99.900%   18.74ms
 99.990%   26.24ms
 99.999%   32.99ms
100.000%   59.55ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.114     0.000000            1         1.00
       1.999     0.100000      1972281         1.11
       2.381     0.200000      3939992         1.25
       2.651     0.300000      5910692         1.43
       2.889     0.400000      7890158         1.67
       3.123     0.500000      9860313         2.00
       3.243     0.550000     10837895         2.22
       3.369     0.600000     11819811         2.50
       3.505     0.650000     12807532         2.86
       3.655     0.700000     13794413         3.33
       3.821     0.750000     14766845         4.00
       3.917     0.775000     15267930         4.44
       4.021     0.800000     15759968         5.00
       4.139     0.825000     16257310         5.71
       4.271     0.850000     16741290         6.67
       4.431     0.875000     17236056         8.00
       4.523     0.887500     17477506         8.89
       4.631     0.900000     17725636        10.00
       4.759     0.912500     17971902        11.43
       4.915     0.925000     18214552        13.33
       5.127     0.937500     18461036        16.00
       5.267     0.943750     18583730        17.78
       5.447     0.950000     18705946        20.00
       5.703     0.956250     18828055        22.86
       6.099     0.962500     18951373        26.67
       6.559     0.968750     19074089        32.00
       6.787     0.971875     19135518        35.56
       7.023     0.975000     19197468        40.00
       7.271     0.978125     19258734        45.71
       7.547     0.981250     19320038        53.33
       7.899     0.984375     19381874        64.00
       8.127     0.985938     19412572        71.11
       8.439     0.987500     19443616        80.00
       8.943     0.989062     19474040        91.43
       9.815     0.990625     19504605       106.67
      10.471     0.992188     19535686       128.00
      10.719     0.992969     19550825       142.22
      10.975     0.993750     19566150       160.00
      11.247     0.994531     19581453       182.86
      11.575     0.995313     19597130       213.33
      11.991     0.996094     19612339       256.00
      12.303     0.996484     19620010       284.44
      12.791     0.996875     19627618       320.00
      13.815     0.997266     19635312       365.71
      14.543     0.997656     19643050       426.67
      15.127     0.998047     19650640       512.00
      15.463     0.998242     19654513       568.89
      15.911     0.998437     19658341       640.00
      16.767     0.998633     19662196       731.43
      18.207     0.998828     19666017       853.33
      18.799     0.999023     19669861      1024.00
      19.039     0.999121     19671856      1137.78
      19.279     0.999219     19673767      1280.00
      19.551     0.999316     19675629      1462.86
      19.903     0.999414     19677556      1706.67
      20.367     0.999512     19679522      2048.00
      20.847     0.999561     19680444      2275.56
      21.759     0.999609     19681395      2560.00
      22.383     0.999658     19682365      2925.71
      22.799     0.999707     19683334      3413.33
      23.151     0.999756     19684285      4096.00
      23.359     0.999780     19684800      4551.11
      23.551     0.999805     19685251      5120.00
      23.871     0.999829     19685739      5851.43
      24.255     0.999854     19686206      6826.67
      25.039     0.999878     19686682      8192.00
      25.695     0.999890     19686925      9102.22
      26.335     0.999902     19687168     10240.00
      26.751     0.999915     19687409     11702.86
      27.263     0.999927     19687645     13653.33
      27.807     0.999939     19687886     16384.00
      28.127     0.999945     19688006     18204.44
      28.447     0.999951     19688130     20480.00
      29.087     0.999957     19688246     23405.71
      30.207     0.999963     19688366     27306.67
      30.831     0.999969     19688489     32768.00
      30.991     0.999973     19688545     36408.89
      31.135     0.999976     19688605     40960.00
      31.311     0.999979     19688666     46811.43
      31.503     0.999982     19688730     54613.33
      31.823     0.999985     19688789     65536.00
      31.967     0.999986     19688817     72817.78
      32.127     0.999988     19688846     81920.00
      32.895     0.999989     19688876     93622.86
      33.279     0.999991     19688905    109226.67
      34.431     0.999992     19688938    131072.00
      34.591     0.999993     19688951    145635.56
      34.751     0.999994     19688966    163840.00
      34.911     0.999995     19688980    187245.71
      35.231     0.999995     19688995    218453.33
      35.423     0.999996     19689010    262144.00
      35.519     0.999997     19689020    291271.11
      38.495     0.999997     19689026    327680.00
      38.559     0.999997     19689033    374491.43
      38.623     0.999998     19689040    436906.67
      38.815     0.999998     19689048    524288.00
      43.711     0.999998     19689056    582542.22
      43.711     0.999998     19689056    655360.00
      43.839     0.999999     19689060    748982.86
      43.871     0.999999     19689063    873813.33
      43.903     0.999999     19689067   1048576.00
      59.071     0.999999     19689069   1165084.44
      59.135     0.999999     19689070   1310720.00
      59.167     0.999999     19689073   1497965.71
      59.199     0.999999     19689076   1747626.67
      59.199     1.000000     19689076   2097152.00
      59.263     1.000000     19689077   2330168.89
      59.295     1.000000     19689078   2621440.00
      59.327     1.000000     19689079   2995931.43
      59.359     1.000000     19689080   3495253.33
      59.391     1.000000     19689081   4194304.00
      59.391     1.000000     19689081   4660337.78
      59.423     1.000000     19689082   5242880.00
      59.423     1.000000     19689082   5991862.86
      59.455     1.000000     19689083   6990506.67
      59.455     1.000000     19689083   8388608.00
      59.455     1.000000     19689083   9320675.55
      59.487     1.000000     19689084  10485760.00
      59.487     1.000000     19689084  11983725.71
      59.487     1.000000     19689084  13981013.34
      59.487     1.000000     19689084  16777216.00
      59.487     1.000000     19689084  18641351.10
      59.551     1.000000     19689085  20971519.98
      59.551     1.000000     19689085          inf
#[Mean    =        3.334, StdDeviation   =        1.555]
#[Max     =       59.520, Total count    =     19689085]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  21502579 requests in 2.00m, 17.20GB read
Requests/sec: 179190.44
Transfer/sec:    146.79MB